app/controllers/prjeulersamples_controller.rb

  def index
    @prjeulersamples = PrjEulerSample.all
---
SELECT "prj_euler_samples".* FROM "prj_euler_samples"